package Lectures.Lecture1.Ex002;


// Этот код представляет класс Point2D, который предполагает представление точки на двумерной плоскости. Он содержит два поля x и y, которые представляют координаты точки.

// Поля класса:
// int x, y;: Эти поля представляют координаты точки на двумерной плоскости. x обозначает координату по горизонтали (ось X), а y - по вертикали (ось Y).
// Конструкторы:
// В этом коде отсутствуют явные конструкторы, поэтому используется конструктор по умолчанию, предоставляемый Java. Он неявно создается компилятором Java, если не определено ни одного другого конструктора в классе. Этот конструктор инициализирует поля x и y значением по умолчанию, которое для типа int равно 0.
// Доступ к полям:
// Поля x и y являются доступными напрямую внутри класса Point2D, но они не являются public, поэтому не будут доступны извне класса.
// Использование класса:
// Этот класс может использоваться для представления точек на плоскости в двумерном пространстве. Например, объекты этого класса могут использоваться для хранения координат точек на карте, в графике и т.д.


public class Point2D  {
    int x, y;
    
}
