package Dz.Dz6;


// O - Принцип открытости/закрытости (Open/Closed Principle):
// Добавьте новый метод calculateDiscount() в класс Customer, который будет рассчитывать скидку для заказов. Это позволит расширить функциональность класса без изменения его исходного кода.


public class Customer {
    // Реализация класса Customer
    
    public void calculateDiscount() {
        // Рассчитывает скидку для заказов
        // Добавление нового метода calculateDiscount() в класс Customer позволяет расширить
        // функциональность класса без изменения его исходного кода.
        // Это соответствует принципу OCP, поскольку класс открыт для расширения новой функциональностью
        // и закрыт для модификации своего исходного кода.
    }
}
